nwlab/winding/firmware/Middlewares/Third_Party/StepperHAL_STM32F4x1-Library/src/StepperHAL_STM32F4x1.cpp
// StepperHAL_STM32F4x1.cpp

#include "StepperHAL_STM32F4x1.h"
#include "StepperHAL_Config.h" // MUST come prima per definire StepperHAL_DEBUG_ENABLE e feature
#include "StepperHAL_Debug.h"
#include "StepperHAL_Lang.h"
#include "StepperHAL_Utils.h"
#include "stm32f4xx_hal_gpio.h"
#include <math.h>
#include <string.h>


// -----------------------------
// Constructors
// -----------------------------
StepperHAL::StepperHAL(TIM_TypeDef *timer, uint32_t channel, uint8_t dirPin, int8_t enPin, uint32_t stepsMotorRev,
                       float microstep, float mmPerRev)
    : _timer(timer), _htim{} // default init
      ,
      _timerClockHz(0), _dirPin(dirPin), _enPin(enPin), _stepPin(PA_0) // placeholder, overwritten in the body
      ,
      _channel(channel), _stepsMotorRev(stepsMotorRev), _microstep(microstep), _mmPerRev(mmPerRev),
      _invertDirection(false), _active(false), _useDMA(false), _pendingStop(false), _position(0), _logicalPosition(0),
      _target(0), _effectiveTarget(0), _direction(true), _moveDir(0), _lastDir(0), _pendingLogical(0),
      _backlashMM(mm(0.0f)), _backlashStep(step(0)), _useBacklashMM(false), _useBacklashStep(false),
      _directionInitialized(false), _timing(), _currentPhase(PHASE_IDLE), _accelTable(nullptr), _decelTable(nullptr),
      _accelSize(0), _decelSize(0), _accelIndex(0), _decelIndex(0), _cruiseARR(0), _cruiseSize(0), _cruiseRemaining(0),
      _hdma{}, _dmaIndex(0), _targetARR(0), _holdPhase(false), _decelPhase(false), _diag_accelIndex(0),
      _diag_cruiseRemaining(0), _diag_decelIndex(0), _diag_phase(0), _useSCurve(false), _jerkSymmetric(true),
      _jerkAccMMs3(2500.0f), _jerkDecMMs3(2000.0f), _useManualJerk(false), _jerkAccelUp(0.0f), _jerkAccelFlat(0.0f),
      _jerkAccelDown(0.0f), _jerkDecelUp(0.0f), _jerkDecelFlat(0.0f), _jerkDecelDown(0.0f), _jerkRatio(1.0f),
      _minFreqHz(0.0f), _label(nullptr)
{
    // Non leggere clock qui: lo facciamo in begin() per sicurezza
    if (_timer == TIM2)
        _stepPin = PA_15;
    else if (_timer == TIM3)
        _stepPin = PB_5;
    else if (_timer == TIM4)
        _stepPin = PB_6;
    else if (_timer == TIM5)
        _stepPin = PA_2;
    else
        _stepPin = PA_0;
}
// costruttore semplificato che passa effectiveStepsMotorRev al posto
// di (stepsMotorRev, microstep=1.0f)
StepperHAL::StepperHAL(TIM_TypeDef *timer, uint32_t channel, uint8_t dirPin, int8_t enPin,
                       uint32_t effectiveStepsMotorRev, float mmPerRev)
    : StepperHAL(timer, channel, dirPin, enPin,
                 /* stepsMotorRev = */ effectiveStepsMotorRev,
                 /* microstep    = */ 1.0f,
                 /* mmPerRev     = */ mmPerRev)
{
}

// -----------------------------
// Setup
// -----------------------------
void StepperHAL::begin()
{
    _timerClockHz = HAL_RCC_GetSysClockFreq();
    configureStepPin();
    configureDirPin();
    if (_enPin >= 0)
    {
        configureEnPin();
    }

    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print(msg("pin configurati: | STEP: ", "pin configured: | STEP: "));
    SerialDB.print(pinName(_stepPin));
    SerialDB.print(" | ");
    SerialDB.print(msg("DIR: ", "DIR: "));
    SerialDB.print(pinName(_dirPin));
    SerialDB.print(" | ");
    SerialDB.print(msg("EN: ", "EN: "));
    SerialDB.println(_enPin >= 0 ? pinName(_enPin) : msg("nessuno", "none"));

    float stepsPerRev = getStepsPerRev();
    float mmPerRev = _mmPerRev;
    float mmPerStep = mmPerRev / stepsPerRev;
    float stepsPerMm = stepsPerRev / mmPerRev;

    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print(msg("Passi effettivi/giro: ", "Effective steps/rev: "));
    SerialDB.print(stepsPerRev);
    SerialDB.print(" | ");
    SerialDB.print(msg("mm/giro: ", "mm/rev: "));
    SerialDB.print(mmPerRev, 2);
    SerialDB.print(" | ");
    SerialDB.print(msg("1 passo = ", "1 step = "));
    SerialDB.print(mmPerStep, 6);
    SerialDB.print(" mm | ");
    SerialDB.print(msg("1 mm = ", "1 mm = "));
    SerialDB.print(stepsPerMm);
    SerialDB.println(msg(" passi", " steps"));
}

void StepperHAL::configureStepPin()
{
    GPIO_InitTypeDef GPIO_InitStruct;
    memset(&GPIO_InitStruct, 0, sizeof(GPIO_InitStruct));

    if (_stepPin >= PA_0 && _stepPin <= PA_15)
        __HAL_RCC_GPIOA_CLK_ENABLE();
    else if (_stepPin >= PB_0 && _stepPin <= PB_15)
        __HAL_RCC_GPIOB_CLK_ENABLE();

    GPIO_TypeDef *port = (_stepPin >= PB_0 ? GPIOB : GPIOA);
    uint16_t pin = (uint16_t)(1u << (_stepPin - (_stepPin >= PB_0 ? PB_0 : PA_0)));

    GPIO_InitStruct.Pin = pin;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = 0;

    if (_timer == TIM2)
        GPIO_InitStruct.Alternate = GPIO_AF1_TIM2;
    else if (_timer == TIM3)
        GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
    else if (_timer == TIM4)
        GPIO_InitStruct.Alternate = GPIO_AF2_TIM4;
    else if (_timer == TIM5)
        GPIO_InitStruct.Alternate = GPIO_AF2_TIM5;

    HAL_GPIO_Init(port, &GPIO_InitStruct);
}

void StepperHAL::configureDirPin()
{
    GPIO_InitTypeDef GPIO_InitStruct;
    memset(&GPIO_InitStruct, 0, sizeof(GPIO_InitStruct));

    if (_dirPin >= PA_0 && _dirPin <= PA_15)
        __HAL_RCC_GPIOA_CLK_ENABLE();
    else if (_dirPin >= PB_0 && _dirPin <= PB_15)
        __HAL_RCC_GPIOB_CLK_ENABLE();

    GPIO_TypeDef *port = (_dirPin >= PB_0 ? GPIOB : GPIOA);
    uint16_t pin = (uint16_t)(1u << (_dirPin - (_dirPin >= PB_0 ? PB_0 : PA_0)));

    HAL_GPIO_WritePin(port, pin, GPIO_PIN_SET);

    GPIO_InitStruct.Pin = pin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = 0;

