nwlab/winding/firmware/Middlewares/Third_Party/StepperHAL_STM32F4x1-Library/src/StepperHAL_STM32F4x1.cpp
    HAL_GPIO_Init(port, &GPIO_InitStruct);
}

void StepperHAL::configureEnPin()
{
    GPIO_InitTypeDef GPIO_InitStruct;
    memset(&GPIO_InitStruct, 0, sizeof(GPIO_InitStruct));

    if (_enPin >= PA_0 && _enPin <= PA_15)
        __HAL_RCC_GPIOA_CLK_ENABLE();
    else if (_enPin >= PB_0 && _enPin <= PB_15)
        __HAL_RCC_GPIOB_CLK_ENABLE();

    GPIO_TypeDef *port = (_enPin >= PB_0 ? GPIOB : GPIOA);
    uint16_t pin = (uint16_t)(1u << (_enPin - (_enPin >= PB_0 ? PB_0 : PA_0)));

    HAL_GPIO_WritePin(port, pin, GPIO_PIN_RESET);

    GPIO_InitStruct.Pin = pin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = 0;

    HAL_GPIO_Init(port, &GPIO_InitStruct);
}

void StepperHAL::digitalWrite(uint8_t _pin, uint8_t _val)
{
    GPIO_TypeDef *port = (_pin >= PB_0 ? GPIOB : GPIOA);
    uint16_t pin = (uint16_t)(1u << (_pin - (_pin >= PB_0 ? PB_0 : PA_0)));

    HAL_GPIO_WritePin(port, pin, _val ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

void StepperHAL::configureTimer(uint32_t arr, uint32_t pulse)
{
    if (_timer == TIM2)
        __HAL_RCC_TIM2_CLK_ENABLE();
    else if (_timer == TIM3)
        __HAL_RCC_TIM3_CLK_ENABLE();
    else if (_timer == TIM4)
        __HAL_RCC_TIM4_CLK_ENABLE();
    else if (_timer == TIM5)
        __HAL_RCC_TIM5_CLK_ENABLE();

    _htim.Instance = _timer;
    _htim.Init.Prescaler = _timing.prescaler;
    _htim.Init.CounterMode = TIM_COUNTERMODE_UP;
    _htim.Init.Period = (arr == 0 ? 1 : arr);
    _htim.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    _htim.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;

    HAL_TIM_Base_Init(&_htim);
    HAL_TIM_PWM_Init(&_htim);

    __HAL_TIM_SET_COUNTER(&_htim, 0);
    __HAL_TIM_SET_COMPARE(&_htim, _channel, 0);

    TIM_OC_InitTypeDef sConfigOC;
    memset(&sConfigOC, 0, sizeof(sConfigOC));

    sConfigOC.OCMode = TIM_OCMODE_PWM1;
    sConfigOC.Pulse = (pulse == 0 ? 1 : pulse);
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;

#if defined(TIM_OCNPOLARITY_HIGH)
    sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
#else
    sConfigOC.OCNPolarity = 0;
#endif

#if defined(TIM_OCFAST_ENABLE)
    sConfigOC.OCFastMode = TIM_OCFAST_ENABLE;
#else
    sConfigOC.OCFastMode = 0;
#endif

#if defined(TIM_OCIDLESTATE_RESET)
    sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
#else
    sConfigOC.OCIdleState = 0;
#endif

#if defined(TIM_OCNIDLESTATE_RESET)
    sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
#else
    sConfigOC.OCNIdleState = 0;
#endif

    HAL_TIM_PWM_ConfigChannel(&_htim, &sConfigOC, _channel);

    __HAL_TIM_CLEAR_FLAG(&_htim, TIM_FLAG_UPDATE);
    __HAL_TIM_ENABLE_IT(&_htim, TIM_IT_UPDATE);

    if (_timer == TIM2)
    {
        HAL_NVIC_SetPriority(TIM2_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(TIM2_IRQn);
    }
    else if (_timer == TIM3)
    {
        HAL_NVIC_SetPriority(TIM3_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(TIM3_IRQn);
    }
    else if (_timer == TIM4)
    {
        HAL_NVIC_SetPriority(TIM4_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(TIM4_IRQn);
    }
    else if (_timer == TIM5)
    {
        HAL_NVIC_SetPriority(TIM5_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(TIM5_IRQn);
    }
}

void StepperHAL::delay(unsigned long ms)
{
    HAL_Delay(ms);
}

void StepperHAL::delayMicroseconds(unsigned int usec)
{
    if (usec == 0)
    {
        return;
    }

    /*
     *  The following loop:
     *
     *    for (; ul; ul--) {
     *      __asm__ volatile("");
     *    }
     *
     *  produce the following assembly code:
     *
     *    loop:
     *      subs r3, #1        // 1 Core cycle
     *      bne.n loop         // 1 Core cycle + 1 if branch is taken
     */

    // VARIANT_MCK / 1000000 == cycles needed to delay 1uS
    //                     3 == cycles used in a loop
    uint32_t n = usec * (SystemCoreClock / 1000000) / 3;
    __asm__ __volatile__("1:              \n"
                         "   sub %0, #1   \n" // substract 1 from %0 (n)
                         "   bne 1b       \n" // if result is not 0 jump to 1
                         : "+r"(n)            // '%0' is n variable with RW constraints
                         :                    // no input
                         :                    // no clobber
    );
    // https://gcc.gnu.org/onlinedocs/gcc/Extended-Asm.html
    // https://gcc.gnu.org/onlinedocs/gcc/Extended-Asm.html#Volatile
}

// -----------------------------
// Helpers
// -----------------------------
uint32_t StepperHAL::clampARRFromFreq(uint32_t timerBaseFreq, float freq)
{
    if (freq <= 0.0f)
        freq = 1.0f;
    float arrf = (float)timerBaseFreq / freq;
    if (arrf < 2.0f)
        arrf = 2.0f;
    if (arrf > 65535.0f)
        arrf = 65535.0f;
    return (uint32_t)arrf;
}

// -----------------------------
// Backlash + planning
// -----------------------------
void StepperHAL::planEffectiveTarget(long requestedTarget)
{
    _target = requestedTarget;
    _pendingLogical = requestedTarget;

    long delta = requestedTarget - _logicalPosition;
    int8_t newDir = (delta > 0) ? 1 : (delta < 0 ? -1 : 0);

    long backlashSteps = resolveBacklashSteps();
    long stepsToDo = llabs(delta);

    if (_lastDir == 0)
    {
        _effectiveTarget = _position + (newDir * stepsToDo);
    }
    else
    {
        if (newDir != _lastDir)
        {
            long currentPreload = _position - _logicalPosition;
            if (currentPreload == 0)
            {
                _effectiveTarget = _position + (newDir * (stepsToDo + backlashSteps));
                stepsToDo += backlashSteps;
            }
            else if ((currentPreload > 0 && newDir > 0) || (currentPreload < 0 && newDir < 0))
            {
                _effectiveTarget = _position + (newDir * stepsToDo);
            }
            else
            {
                _effectiveTarget = _position + (newDir * (stepsToDo + backlashSteps));
                stepsToDo += backlashSteps;
            }
        }
        else
        {
            _effectiveTarget = _position + (newDir * stepsToDo);
        }
    }

