nwlab/winding/firmware/Middlewares/Third_Party/StepperHAL_STM32F4x1-Library/src/StepperHAL_STM32F4x1.cpp
    _direction = (newDir < 0);
    _moveDir = newDir;
    _lastDir = newDir;

    int32_t backlashEffettivo = 0;
    if (backlashSteps > 0 && stepsToDo > llabs(delta))
    {
        backlashEffettivo = (newDir > 0) ? backlashSteps : -backlashSteps;
    }

    const char *dirLabel = (newDir > 0) ? "CW" : (newDir < 0 ? "CCW" : "STOP");

    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print(msg("Movimento iniziato da posizione logica=", "Movement started from position logical="));
    SerialDB.print(_logicalPosition);
    SerialDB.print(msg(" : reale=", " : real="));
    SerialDB.print(_position);
    SerialDB.print(msg(" / target=", " / target="));
    SerialDB.print(_target);
    SerialDB.print(msg(" / step necessari=", " / steps needed="));
    SerialDB.print(stepsToDo);
    if (backlashEffettivo != 0)
    {
        SerialDB.print(msg(", correzione backlash applicata (", ", backlash correction applied ("));
        SerialDB.print(backlashEffettivo);
        SerialDB.print(")");
    }
    SerialDB.print(msg(" / Dir=", " / Dir="));
    SerialDB.println(dirLabel);
}

// -----------------------------
// Constant-step movement
// -----------------------------
void StepperHAL::moveToTarget(int32_t targetSteps, float freqHz)
{
    int32_t stepsNeeded = targetSteps - _position;

    if (stepsNeeded == 0)
    {
        _logicalPosition = targetSteps;
        _position = targetSteps;
        SerialDB.print("[StepperHAL] (");
        SerialDB.print(getLabel());
        SerialDB.println(msg(") Nessun movimento: già in posizione", ") No movement: already in position"));
        return;
    }

    digitalWrite(_dirPin, _invertDirection ? !_direction : _direction);

    _active = true;
    _currentPhase = PHASE_CRUISE;

    uint32_t arr = clampARRFromFreq(_timing.timerBaseFreq, freqHz);
    uint32_t pulse = _timing.pulseTicks;

    configureTimer(arr, pulse);

    HAL_TIM_PWM_Start(&_htim, _channel);
    HAL_TIM_Base_Start_IT(&_htim);
}

// -----------------------------
// Movement API (no accel)
// -----------------------------
void StepperHAL::moveToPosition(mm distance, Speed rpm)
{
    int32_t targetSteps = static_cast<int32_t>(roundf(distance.value * stepsPerMM()));
    planEffectiveTarget(targetSteps);
    float revsPerSec = rpm.rpm / 60.0f;
    float stepsPerSec = revsPerSec * _stepsMotorRev * _microstep;
    moveToTarget(_effectiveTarget, stepsPerSec);
}

void StepperHAL::moveToPosition(mm distance, Feed feedRate)
{
    int32_t targetSteps = static_cast<int32_t>(roundf(distance.value * stepsPerMM()));
    planEffectiveTarget(targetSteps);
    float stepsPerSec = (feedRate.mmPerMin / 60.0f) * stepsPerMM();
    moveToTarget(_effectiveTarget, stepsPerSec);
}

void StepperHAL::moveToPosition(step steps, Speed rpm)
{
    planEffectiveTarget(steps.count);
    float revsPerSec = rpm.rpm / 60.0f;
    float stepsPerSec = revsPerSec * _stepsMotorRev * _microstep;
    moveToTarget(_effectiveTarget, stepsPerSec);
}

void StepperHAL::moveToPosition(step steps, Feed feedRate)
{
    planEffectiveTarget(steps.count);
    float stepsPerSec = (feedRate.mmPerMin / 60.0f) * stepsPerMM();
    moveToTarget(_effectiveTarget, stepsPerSec);
}

void StepperHAL::moveRelative(mm delta, Speed rpm)
{
    int32_t targetSteps = _logicalPosition + static_cast<int32_t>(roundf(delta.value * stepsPerMM()));
    planEffectiveTarget(targetSteps);
    float revsPerSec = rpm.rpm / 60.0f;
    float stepsPerSec = revsPerSec * _stepsMotorRev * _microstep;
    moveToTarget(_effectiveTarget, stepsPerSec);
}

void StepperHAL::moveRelative(mm delta, Feed feedRate)
{
    int32_t targetSteps = _logicalPosition + static_cast<int32_t>(roundf(delta.value * stepsPerMM()));
    planEffectiveTarget(targetSteps);
    float stepsPerSec = (feedRate.mmPerMin / 60.0f) * stepsPerMM();
    moveToTarget(_effectiveTarget, stepsPerSec);
}

void StepperHAL::moveRelative(step delta, Speed rpm)
{
    int32_t targetSteps = _logicalPosition + delta.count;
    planEffectiveTarget(targetSteps);
    float revsPerSec = rpm.rpm / 60.0f;
    float stepsPerSec = revsPerSec * _stepsMotorRev * _microstep;
    moveToTarget(_effectiveTarget, stepsPerSec);
}

void StepperHAL::moveRelative(step delta, Feed feedRate)
{
    int32_t targetSteps = _logicalPosition + delta.count;
    planEffectiveTarget(targetSteps);
    float stepsPerSec = (feedRate.mmPerMin / 60.0f) * stepsPerMM();
    moveToTarget(_effectiveTarget, stepsPerSec);
}

// -----------------------------
// Trapezoidal table generator
// -----------------------------
// Compiled only se USE_TRAPEZOIDAL è definito
#if USE_TRAPEZOIDAL

void StepperHAL::generateMotionTables(int32_t totalSteps, float maxFreqHz, float accelMMs2, float decelMMs2)
{
    if (totalSteps <= 0)
    {
        _accelSize = 0;
        _cruiseSize = 0;
        _decelSize = 0;
        return;
    }

    const float mmPerStep = _mmPerRev / (_stepsMotorRev * _microstep);

    // minimo frequenza applicata anche al profilo trapezoidale
    float minFreqHz = fmaxf(_minFreqHz, DEFAULT_MIN_FREQ_HZ);

    float vMax_mm_s = maxFreqHz * mmPerStep;
    float sAccel_mm = (vMax_mm_s * vMax_mm_s) / (2.0f * accelMMs2);
    float sDecel_mm = (vMax_mm_s * vMax_mm_s) / (2.0f * decelMMs2);

    int32_t sAccel_steps = (int32_t)roundf(sAccel_mm / mmPerStep);
    int32_t sDecel_steps = (int32_t)roundf(sDecel_mm / mmPerStep);

    if (sAccel_steps + sDecel_steps > totalSteps)
    {
        float ratio = (float)sAccel_steps / (float)(sAccel_steps + sDecel_steps);
        sAccel_steps = (int32_t)(totalSteps * ratio);
        sDecel_steps = totalSteps - sAccel_steps;
    }

    int32_t sConst_steps = totalSteps - sAccel_steps - sDecel_steps;

    _accelSize = sAccel_steps;
    _cruiseSize = sConst_steps;
    _decelSize = sDecel_steps;

    if (_accelTable)
    {
        delete[] _accelTable;
        _accelTable = nullptr;
    }
    if (_decelTable)
    {
        delete[] _decelTable;
        _decelTable = nullptr;
    }

    if (_accelSize > 0)
        _accelTable = new uint32_t[_accelSize];
    if (_decelSize > 0)
        _decelTable = new uint32_t[_decelSize];

    for (int32_t i = 0; i < _accelSize; ++i)
    {
        float s = (i + 1) * mmPerStep;
        float v = sqrtf(2.0f * accelMMs2 * s);
        float freq = v / mmPerStep;
        if (freq < 1.0f)
            freq = 1.0f;
        freq = fmaxf(freq, minFreqHz);
        _accelTable[i] = clampARRFromFreq(_timing.timerBaseFreq, freq);
    }

