nwlab/winding/firmware/Middlewares/Third_Party/StepperHAL_STM32F4x1-Library/src/StepperHAL_STM32F4x1.cpp
    // cruise ARR (use maxFreqHz but ensure consistency with minFreqHz if needed)
    _cruiseARR = clampARRFromFreq(_timing.timerBaseFreq, maxFreqHz);

    for (int32_t i = 0; i < _decelSize; ++i)
    {
        float s = (_decelSize - i) * mmPerStep;
        float v = sqrtf(2.0f * decelMMs2 * s);
        float freq = v / mmPerStep;
        if (freq < 1.0f)
            freq = 1.0f;
        freq = fmaxf(freq, minFreqHz);
        _decelTable[i] = clampARRFromFreq(_timing.timerBaseFreq, freq);
    }

    if (_accelSize > 0)
    {
        _accelTable[0] = clampARRFromFreq(_timing.timerBaseFreq, minFreqHz);
        _accelTable[_accelSize - 1] = _cruiseARR;
    }
    if (_decelSize > 0)
    {
        _decelTable[0] = _cruiseARR;
        _decelTable[_decelSize - 1] = clampARRFromFreq(_timing.timerBaseFreq, minFreqHz);
    }

    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print(msg("Profilo DMA → ", "DMA profile → "));
    SerialDB.print(totalSteps);
    SerialDB.print(msg(" steps, accel = ", " steps, accel = "));
    SerialDB.print(accelMMs2, 2);
    SerialDB.print(msg(" mm/s², decel = ", " mm/s², decel = "));
    SerialDB.print(decelMMs2, 2);
    SerialDB.println(" mm/s²");

    SerialDB.print("  → ");
    SerialDB.print(msg("Accelerazione: ", "Acceleration: "));
    SerialDB.print(_accelSize);
    SerialDB.println(msg(" steps", " steps"));

    SerialDB.print("  → ");
    SerialDB.print(msg("Regime: ", "Cruise: "));
    SerialDB.print(_cruiseSize);
    SerialDB.println(msg(" steps", " steps"));

    SerialDB.print("  → ");
    SerialDB.print(msg("Decelerazione: ", "Deceleration: "));
    SerialDB.print(_decelSize);
    SerialDB.println(msg(" steps", " steps"));

    SerialDB.print("  → ");
    SerialDB.println(_cruiseSize > 0 ? msg("Profilo: trapezoidale", "Profile: trapezoidal")
                                     : msg("Profilo: triangolare", "Profile: triangular"));
}

#endif // USE_TRAPEZOIDAL

// -----------------------------
// S-curve (optional, compiled only if USE_S_CURVE)
// -----------------------------
#if USE_S_CURVE

void StepperHAL::useSCurve(bool enable)
{
    _useSCurve = enable;
    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print("S‑curve mode: ");
    SerialDB.println(enable ? "ON" : "OFF");
}

void StepperHAL::setJerk(float jerkAcc)
{
    _jerkAccMMs3 = jerkAcc;
    _jerkDecMMs3 = jerkAcc;
    _jerkSymmetric = true;
}
void StepperHAL::setJerk(float jerkAcc, float jerkDec)
{
    _jerkAccMMs3 = jerkAcc;
    _jerkDecMMs3 = jerkDec;
    _jerkSymmetric = false;
}

void StepperHAL::setJerkRatio(float ratio)
{
    // clamp del parametro ratio (jerkRatio)
    if (ratio < JERK_RATIO_MIN)
    {
        SerialDB.print(msg("Attenzione: jerkRatio sotto il minimo, limitato a ",
                           "Warning: jerkRatio below minimum, clamped to "));
        SerialDB.println(JERK_RATIO_MIN, 3);
        ratio = JERK_RATIO_MIN;
    }
    else if (ratio > JERK_RATIO_MAX)
    {
        SerialDB.print(msg("Attenzione: jerkRatio sopra il massimo, limitato a ",
                           "Warning: jerkRatio above maximum, clamped to "));
        SerialDB.println(JERK_RATIO_MAX, 3);
        ratio = JERK_RATIO_MAX;
    }

    // salva il valore già corretto e disabilita il manual jerk
    _jerkRatio = ratio;
    _useManualJerk = false;

    // log di conferma
    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") JerkRatio set — ratio=");
    SerialDB.println(_jerkRatio, 3);
}

void StepperHAL::setManualJerk(float jerkAccUp, float jerkAccFlat, float jerkAccDown, float jerkDecUp,
                               float jerkDecFlat, float jerkDecDown)
{
    _jerkAccelUp = jerkAccUp;
    _jerkAccelFlat = jerkAccFlat;
    _jerkAccelDown = jerkAccDown;
    _jerkDecelUp = jerkDecUp;
    _jerkDecelFlat = jerkDecFlat;
    _jerkDecelDown = jerkDecDown;
    _useManualJerk = true;

    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print("Manual jerk set — aUp=");
    SerialDB.print(_jerkAccelUp, 1);
    SerialDB.print(" aFlat=");
    SerialDB.print(_jerkAccelFlat, 1);
    SerialDB.print(" aDown=");
    SerialDB.print(_jerkAccelDown, 1);
    SerialDB.print(" dUp=");
    SerialDB.print(_jerkDecelUp, 1);
    SerialDB.print(" dFlat=");
    SerialDB.print(_jerkDecelFlat, 1);
    SerialDB.print(" dDown=");
    SerialDB.println(_jerkDecelDown, 1);
}

void StepperHAL::useDefaultJerk(bool enable)
{
    if (enable)
        _useManualJerk = false;
    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print("Jerk mode: ");
    SerialDB.println(_useManualJerk ? "manual" : "default");
}

void StepperHAL::computeDefaultJerk(float accelMMs2, float decelMMs2, int jerkSteps, float minFreqHz, float maxFreqHz,
                                    float jerkRatio)
{

    if (jerkSteps < 1)
        jerkSteps = 1;

    float jerkFactor = 0.08f;
    float timeFactor = 4.0f;

    float fMean = (minFreqHz + maxFreqHz) * 0.5f;
    if (fMean <= 0.0f)
        fMean = fmaxf(minFreqHz, 1.0f);

    float dt = timeFactor / fMean;
    float tJerk = jerkSteps * dt;
    if (tJerk <= 0.0f)
        tJerk = dt;

    _jerkAccelUp = accelMMs2 * jerkFactor / tJerk;
    _jerkAccelDown = accelMMs2 * jerkFactor / tJerk;
    _jerkAccelFlat = 0.0f;

    _jerkDecelUp = decelMMs2 * jerkFactor / tJerk * jerkRatio;
    _jerkDecelDown = decelMMs2 * jerkFactor / tJerk * jerkRatio;
    _jerkDecelFlat = 0.0f;

    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print("Jerk default — aUp=");
    SerialDB.print(_jerkAccelUp, 1);
    SerialDB.print(" aFlat=");
    SerialDB.print(_jerkAccelFlat, 1);
    SerialDB.print(" aDown=");
    SerialDB.print(_jerkAccelDown, 1);
    SerialDB.print(" dUp=");
    SerialDB.print(_jerkDecelUp, 1);
    SerialDB.print(" dFlat=");
    SerialDB.print(_jerkDecelFlat, 1);
    SerialDB.print(" dDown=");
    SerialDB.print(_jerkDecelDown, 1);
    SerialDB.print(" JerkRatio=");
    SerialDB.println(_jerkRatio);
}

