nwlab/winding/firmware/Middlewares/Third_Party/StepperHAL_STM32F4x1-Library/src/StepperHAL_STM32F4x1.cpp
void StepperHAL::generateMotionTablesSCurve(int32_t totalSteps, float maxFreqHz, float accelMMs2, float decelMMs2)
{
    // niente da fare se non ci sono passi
    if (totalSteps <= 0)
    {
        _accelSize = 0;
        _cruiseSize = 0;
        _decelSize = 0;
        return;
    }

    // frequenza minima e conversione mm→passo
    float minFreqHz = fmaxf(_minFreqHz, DEFAULT_MIN_FREQ_HZ);
    const float mmPerStep = _mmPerRev / (_stepsMotorRev * _microstep);

    // distanza percorsa in accel/decel [mm]
    float vMax_mm_s = maxFreqHz * mmPerStep;
    float sAccel_mm = (vMax_mm_s * vMax_mm_s) / (2.0f * accelMMs2);
    float sDecel_mm = (vMax_mm_s * vMax_mm_s) / (2.0f * decelMMs2);

    // passi in accel/decel
    int32_t accelSteps = (int32_t)roundf(sAccel_mm / mmPerStep);
    int32_t decelSteps = (int32_t)roundf(sDecel_mm / mmPerStep);

    // se accel+decel superano totalSteps, ridistribuisci
    if (accelSteps + decelSteps > totalSteps)
    {
        accelSteps = (int32_t)(totalSteps * 0.4f);
        decelSteps = (int32_t)(totalSteps * 0.4f);
        if (accelSteps + decelSteps > totalSteps)
        {
            accelSteps = totalSteps / 2;
            decelSteps = totalSteps - accelSteps;
        }
    }

    // assegna dimensioni sezioni
    _accelSize = (accelSteps < 0 ? 0 : accelSteps);
    _decelSize = (decelSteps < 0 ? 0 : decelSteps);
    _cruiseSize = totalSteps - _accelSize - _decelSize;
    if (_cruiseSize < 0)
        _cruiseSize = 0;

    // pausa IRQ per ricreare tabelle
    IRQn_Type irq = (TIM2 == _timer   ? TIM2_IRQn
                     : TIM3 == _timer ? TIM3_IRQn
                     : TIM4 == _timer ? TIM4_IRQn
                     : TIM5 == _timer ? TIM5_IRQn
                                      : (IRQn_Type)0);
    if (irq)
        NVIC_DisableIRQ(irq);

    // (ri)crea buffer
    if (_accelTable)
        delete[] _accelTable;
    if (_decelTable)
        delete[] _decelTable;
    _accelTable = (_accelSize > 0 ? new uint32_t[_accelSize] : nullptr);
    _decelTable = (_decelSize > 0 ? new uint32_t[_decelSize] : nullptr);

    if (irq)
        NVIC_EnableIRQ(irq);

    // valore ARR di crociera
    _cruiseARR = clampARRFromFreq(_timing.timerBaseFreq, maxFreqHz);

    // suddivisione aUp/aFlat/aDown e dUp/dFlat/dDown
    int baseJerkAccel = _accelSize / 3;
    if (baseJerkAccel < 1)
        baseJerkAccel = 1;
    _jerkAccelUpSteps = baseJerkAccel;
    _jerkAccelDownSteps = baseJerkAccel;
    {
        int flatAcc = _accelSize - _jerkAccelUpSteps - _jerkAccelDownSteps;
        _jerkAccelFlatSteps = (flatAcc > 0 ? flatAcc : 0);
    }

    int baseJerkDecel = _decelSize / 3;
    if (baseJerkDecel < 1)
        baseJerkDecel = 1;
    _jerkDecelUpSteps = baseJerkDecel;
    _jerkDecelDownSteps = baseJerkDecel;
    {
        int flatDec = _decelSize - _jerkDecelUpSteps - _jerkDecelDownSteps;
        _jerkDecelFlatSteps = (flatDec > 0 ? flatDec : 0);
    }

    // (ri)calcolo parametri jerk se non manuale
    if (!_useManualJerk)
    {
        computeDefaultJerk(accelMMs2, decelMMs2, _jerkAccelUpSteps, minFreqHz, maxFreqHz, _jerkRatio);
    }

    // tabella ARR S-curve accel
    for (int i = 0; i < _accelSize; ++i)
    {
        float p = (_accelSize > 1 ? (float)i / (_accelSize - 1) : 1.0f);
        float e = (p < 0.5f) ? 4.0f * p * p * p : 1.0f - powf(-2.0f * p + 2.0f, 3.0f) / 2.0f;
        float freq = minFreqHz + (maxFreqHz - minFreqHz) * e;
        _accelTable[i] = clampARRFromFreq(_timing.timerBaseFreq, freq);
    }

    // tabella ARR S-curve decel
    for (int i = 0; i < _decelSize; ++i)
    {
        float p = (_decelSize > 1 ? (float)i / (_decelSize - 1) : 1.0f);
        float e = (p < 0.5f) ? 4.0f * p * p * p : 1.0f - powf(-2.0f * p + 2.0f, 3.0f) / 2.0f;
        float freq = maxFreqHz - (maxFreqHz - minFreqHz) * e;
        _decelTable[i] = clampARRFromFreq(_timing.timerBaseFreq, freq);
    }

    // forzature estremi
    if (_accelSize > 0)
    {
        _accelTable[0] = clampARRFromFreq(_timing.timerBaseFreq, minFreqHz);
        _accelTable[_accelSize - 1] = _cruiseARR;
    }
    if (_decelSize > 0)
    {
        _decelTable[0] = _cruiseARR;
        _decelTable[_decelSize - 1] = clampARRFromFreq(_timing.timerBaseFreq, minFreqHz);
    }

    // log suddivisione jerk
    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(")   ");
    SerialDB.print(msg("S-curve fasi accellerazione (Up/Flat/Down)= ", "S-curve accel phases steps (Up/Flat/Down)= "));
    SerialDB.print(_jerkAccelUpSteps);
    SerialDB.print('/');
    SerialDB.print(_jerkAccelFlatSteps);
    SerialDB.print('/');
    SerialDB.println(_jerkAccelDownSteps);

    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(")   ");
    SerialDB.print(msg("S-curve fasi decelerazione (Up/Flat/Down)= ", "S-curve decel phases steps (Up/Flat/Down)= "));
    SerialDB.print(_jerkDecelUpSteps);
    SerialDB.print('/');
    SerialDB.print(_jerkDecelFlatSteps);
    SerialDB.print('/');
    SerialDB.println(_jerkDecelDownSteps);

    // log dimensioni profilo
    uint32_t total = _accelSize + _cruiseSize + _decelSize;

    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print(msg("Profilo DMA -> ", "DMA profile -> "));
    SerialDB.print(total);
    SerialDB.print(" steps, accel = ");
    SerialDB.print(accelMMs2, 2);
    SerialDB.print(" mm/s², decel = ");
    SerialDB.print(decelMMs2, 2);
    SerialDB.println(" mm/s²");

    // log suddivisione jerk
    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(")   ");
    SerialDB.print(msg("-> Accelerazione: ", "-> Acceleration: "));
    SerialDB.println(_accelSize);
    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(")   ");
    SerialDB.print(msg("-> Regime:        ", "-> Cruise:        "));
    SerialDB.println(_cruiseSize);
    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(")   ");
    SerialDB.print(msg("-> Decelerazione: ", "-> Deceleration: "));
    SerialDB.println(_decelSize);
    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.println(msg(")   -> Profilo: S-curve", ")   -> Profile: S-curve"));
}

#endif // USE_S_CURVE

