nwlab/winding/firmware/Middlewares/Third_Party/StepperHAL_STM32F4x1-Library/src/StepperHAL_STM32F4x1.cpp
// -----------------------------
// Movement with accel (DMA-style tables)
// -----------------------------
void StepperHAL::moveToTargetWithAccelDMA(int32_t targetSteps, float maxFreqHz, float accelMMs2, float decelMMs2)
{
    int32_t stepsNeeded = targetSteps - _position;

    if (stepsNeeded == 0)
    {
        _logicalPosition = targetSteps;
        _position = targetSteps;
        SerialDB.print("[StepperHAL] (");
        SerialDB.print(getLabel());
        SerialDB.println(msg(") Nessun movimento: già in posizione", ") No movement: already in position"));
        return;
    }

    bool effectiveDirection = _direction ^ _invertDirection;
    digitalWrite(_dirPin, effectiveDirection ? 1 : 0);
    delayMicroseconds(2);

    _target = targetSteps;
    _active = true;
    _useDMA = true;
    _dmaIndex = 0;
    _holdPhase = false;
    _decelPhase = false;

    int32_t totalSteps = abs(_target - _position);
    if (totalSteps == 0)
    {
        _active = false;
        return;
    }

#if USE_S_CURVE
    if (_useSCurve)
        generateMotionTablesSCurve(totalSteps, maxFreqHz, accelMMs2, decelMMs2);
#if USE_TRAPEZOIDAL
    else
        generateMotionTables(totalSteps, maxFreqHz, accelMMs2, decelMMs2);
#endif
#elif defined(USE_TRAPEZOIDAL)
    // Build without S-curve: force trapezoid
    generateMotionTables(totalSteps, maxFreqHz, accelMMs2, decelMMs2);
#else
    // Neither profile selected at compile time -> fallback to trapezoid for safety
    generateMotionTables(totalSteps, maxFreqHz, accelMMs2, decelMMs2);
#endif

    _accelIndex = 0;
    _decelIndex = 0;
    _cruiseRemaining = _cruiseSize;
    _currentPhase = PHASE_ACCEL;

    uint32_t firstARR = (_accelSize > 0)
                            ? _accelTable[0]
                            : (_cruiseARR > 0 ? _cruiseARR : clampARRFromFreq(_timing.timerBaseFreq, maxFreqHz));

    configureTimer(firstARR, _timing.pulseTicks);

    HAL_TIM_PWM_Start(&_htim, _channel);
    HAL_TIM_Base_Start_IT(&_htim);

    float vMaxRPM = 0.0f;
    float stepsPerRevF = static_cast<float>(_stepsMotorRev) * static_cast<float>(_microstep);
    if (stepsPerRevF > 0.0f)
        vMaxRPM = maxFreqHz * 60.0f / stepsPerRevF;

    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print(msg("Profilo DMA → ", "DMA profile → "));
    SerialDB.print(msg("Target richiesto=", "Requested target="));
    SerialDB.print(_pendingLogical);
    SerialDB.print(" ");
    SerialDB.print(msg("Vmax ", "Vmax "));
    SerialDB.print(vMaxRPM, 2);
    SerialDB.print(" RPM @ ");
    SerialDB.print(maxFreqHz, 2);
    SerialDB.println(" Hz");

    // dumpMotionTablesSerialOnly(0);
}

// -----------------------------
// Dump Motion Tables (advance internal debug)
// -----------------------------
void StepperHAL::dumpMotionTablesSerialOnly(int window /*=16*/)
{
    int32_t aN = _accelSize;
    int32_t cN = _cruiseSize;
    int32_t dN = _decelSize;
    uint32_t cARR = _cruiseARR;

    SerialDB.print("[DUMP] sizes acc/cruise/dec = ");
    SerialDB.print(aN);
    SerialDB.print("/");
    SerialDB.print(cN);
    SerialDB.print("/");
    SerialDB.println(dN);
    SerialDB.print("[DUMP] cruiseARR=");
    SerialDB.println(cARR);

    auto throttle = [&]() { delay(0); };

    auto printArrayBlocks = [&](const uint32_t *arr, int32_t n, const char *label)
    {
        if (n <= 0)
        {
            SerialDB.print("[DUMP] ");
            SerialDB.print(label);
            SerialDB.println(": <empty>");
            return;
        }

        SerialDB.print("[DUMP] ");
        SerialDB.print(label);
        SerialDB.print(" (CSV blocks of 30, total=");
        SerialDB.print(n);
        SerialDB.println(")");

        const int BLOCK = 30;
        int32_t i = 0;
        while (i < n)
        {
            int32_t end = (i + BLOCK < n) ? (i + BLOCK) : n;
            for (int32_t j = i; j < end; ++j)
            {
                SerialDB.print(arr[j]);
                if (j + 1 < end)
                    SerialDB.print(',');
            }
            SerialDB.println();
            i = end;
            if ((i & 0x3FF) == 0)
                throttle();
        }
        SerialDB.println();
    };

    if (window > 0)
    {
        if (aN == 0)
        {
            SerialDB.println("[DUMP] accel: <empty>");
        }
        else
        {
            int start = (aN > window) ? (aN - window) : 0;
            SerialDB.print("[DUMP] accel tail from ");
            SerialDB.print(start);
            SerialDB.print(" to ");
            SerialDB.println(aN - 1);
            for (int i = start; i < aN; ++i)
            {
                SerialDB.print("A[");
                SerialDB.print(i);
                SerialDB.print("] = ");
                SerialDB.println(_accelTable[i]);
            }
            SerialDB.println();
        }

        if (cN == 0)
        {
            SerialDB.println("[DUMP] cruise: <none>");
        }
        else
        {
            SerialDB.print("[DUMP] cruise ARR = ");
            SerialDB.print(cARR);
            SerialDB.print(" repeated ");
            SerialDB.print(cN);
            SerialDB.println(" times");
            SerialDB.println();
        }

        if (dN == 0)
        {
            SerialDB.println("[DUMP] decel: <empty>");
        }
        else
        {
            int end = (dN > window) ? window : dN;
            SerialDB.print("[DUMP] decel head 0..");
            SerialDB.println(end - 1);
            for (int i = 0; i < end; ++i)
            {
                SerialDB.print("D[");
                SerialDB.print(i);
                SerialDB.print("] = ");
                SerialDB.println(_decelTable[i]);
            }
            SerialDB.println();
        }

        SerialDB.print("[DUMP.CSV] accelSize,cruiseARR,cruiseSize,decelSize = ");
        SerialDB.print(aN);
        SerialDB.print(',');
        SerialDB.print(cARR);
        SerialDB.print(',');
        SerialDB.print(cN);
        SerialDB.print(',');
        SerialDB.println(dN);
        if (_accelTable)
            printArrayBlocks(_accelTable, aN, "accel (blocks)");
        if (_decelTable)
            printArrayBlocks(_decelTable, dN, "decel (blocks)");

        SerialDB.println("[DUMP] END");
        return;
    }

    SerialDB.println("[DUMP.FULL] BEGIN");
    SerialDB.print("[DUMP.FULL] sizes acc/cruise/dec = ");
    SerialDB.print(aN);
    SerialDB.print("/");
    SerialDB.print(cN);
    SerialDB.print("/");
    SerialDB.println(dN);
    SerialDB.print("[DUMP.FULL] cruiseARR=");
    SerialDB.println(cARR);

    if (_accelTable)
        printArrayBlocks(_accelTable, aN, "accel (full blocks)");

    SerialDB.print("[DUMP.FULL] cruise ARR = ");
    SerialDB.print(cARR);
    SerialDB.print(" repeated ");
    SerialDB.print(cN);
    SerialDB.println(" times");
    SerialDB.println();

    if (_decelTable)
        printArrayBlocks(_decelTable, dN, "decel (full blocks)");

    SerialDB.println("[DUMP.FULL] END");
}

