nwlab/winding/firmware/Middlewares/Third_Party/StepperHAL_STM32F4x1-Library/src/StepperHAL_STM32F4x1.cpp
// -----------------------------
// Wrappers for various overloads (accel/no-accel) - use roundf as needed
// -----------------------------
void StepperHAL::moveRelativeWithAccel(mm delta, Speed rpm, mms2 accel)
{
    mms2 decel(accel.value);
    moveRelativeWithAccel(delta, rpm, accel, decel);
}
void StepperHAL::moveRelativeWithAccel(mm delta, Feed feedRate, mms2 accel)
{
    mms2 decel(accel.value);
    moveRelativeWithAccel(delta, feedRate, accel, decel);
}
void StepperHAL::moveRelativeWithAccel(step delta, Speed rpm, mms2 accel)
{
    mms2 decel(accel.value);
    moveRelativeWithAccel(delta, rpm, accel, decel);
}
void StepperHAL::moveRelativeWithAccel(step delta, Feed feedRate, mms2 accel)
{
    mms2 decel(accel.value);
    moveRelativeWithAccel(delta, feedRate, accel, decel);
}

void StepperHAL::moveRelativeWithAccel(mm delta, Speed rpm, mms2 accel, mms2 decel)
{
    int32_t deltaSteps = static_cast<int32_t>(roundf(delta.value * stepsPerMM()));
    int32_t targetSteps = _logicalPosition + deltaSteps;
    planEffectiveTarget(targetSteps);

    float revsPerSec = rpm.rpm / 60.0f;
    float stepsPerSec = revsPerSec * _stepsMotorRev * _microstep;

    moveToTargetWithAccelDMA(_effectiveTarget, stepsPerSec, accel.value, decel.value);
}

void StepperHAL::moveRelativeWithAccel(mm delta, Feed feedRate, mms2 accel, mms2 decel)
{
    int32_t deltaSteps = static_cast<int32_t>(roundf(delta.value * stepsPerMM()));
    int32_t targetSteps = _logicalPosition + deltaSteps;
    planEffectiveTarget(targetSteps);

    float stepsPerSec = (feedRate.mmPerMin / 60.0f) * stepsPerMM();

    moveToTargetWithAccelDMA(_effectiveTarget, stepsPerSec, accel.value, decel.value);
}

void StepperHAL::moveRelativeWithAccel(step delta, Speed rpm, mms2 accel, mms2 decel)
{
    int32_t targetSteps = _logicalPosition + delta.count;
    planEffectiveTarget(targetSteps);

    float revsPerSec = rpm.rpm / 60.0f;
    float stepsPerSec = revsPerSec * _stepsMotorRev * _microstep;

    moveToTargetWithAccelDMA(_effectiveTarget, stepsPerSec, accel.value, decel.value);
}

void StepperHAL::moveRelativeWithAccel(step delta, Feed feedRate, mms2 accel, mms2 decel)
{
    int32_t targetSteps = _logicalPosition + delta.count;
    planEffectiveTarget(targetSteps);

    float stepsPerSec = (feedRate.mmPerMin / 60.0f) * stepsPerMM();

    moveToTargetWithAccelDMA(_effectiveTarget, stepsPerSec, accel.value, decel.value);
}

void StepperHAL::moveToPositionWithAccel(mm distance, Speed rpm, mms2 accel)
{
    mms2 decel(accel.value);
    moveToPositionWithAccel(distance, rpm, accel, decel);
}
void StepperHAL::moveToPositionWithAccel(mm distance, Feed feedRate, mms2 accel)
{
    mms2 decel(accel.value);
    moveToPositionWithAccel(distance, feedRate, accel, decel);
}
void StepperHAL::moveToPositionWithAccel(step steps, Speed rpm, mms2 accel)
{
    mms2 decel(accel.value);
    moveToPositionWithAccel(steps, rpm, accel, decel);
}
void StepperHAL::moveToPositionWithAccel(step steps, Feed feedRate, mms2 accel)
{
    mms2 decel(accel.value);
    moveToPositionWithAccel(steps, feedRate, accel, decel);
}

void StepperHAL::moveToPositionWithAccel(mm distance, Speed rpm, mms2 accel, mms2 decel)
{
    int32_t targetSteps = static_cast<int32_t>(roundf(distance.value * stepsPerMM()));
    planEffectiveTarget(targetSteps);
    float revsPerSec = rpm.rpm / 60.0f;
    float stepsPerSec = revsPerSec * _stepsMotorRev * _microstep;
    moveToTargetWithAccelDMA(_effectiveTarget, stepsPerSec, accel.value, decel.value);
}

void StepperHAL::moveToPositionWithAccel(mm distance, Feed feedRate, mms2 accel, mms2 decel)
{
    int32_t targetSteps = static_cast<int32_t>(roundf(distance.value * stepsPerMM()));
    planEffectiveTarget(targetSteps);
    float stepsPerSec = (feedRate.mmPerMin / 60.0f) * stepsPerMM();
    moveToTargetWithAccelDMA(_effectiveTarget, stepsPerSec, accel.value, decel.value);
}

void StepperHAL::moveToPositionWithAccel(step steps, Speed rpm, mms2 accel, mms2 decel)
{
    planEffectiveTarget(steps.count);
    float revsPerSec = rpm.rpm / 60.0f;
    float stepsPerSec = revsPerSec * _stepsMotorRev * _microstep;
    moveToTargetWithAccelDMA(_effectiveTarget, stepsPerSec, accel.value, decel.value);
}

void StepperHAL::moveToPositionWithAccel(step steps, Feed feedRate, mms2 accel, mms2 decel)
{
    planEffectiveTarget(steps.count);
    float stepsPerSec = (feedRate.mmPerMin / 60.0f) * stepsPerMM();
    moveToTargetWithAccelDMA(_effectiveTarget, stepsPerSec, accel.value, decel.value);
}

// -----------------------------
// State & control (resto del file unchanged)
// -----------------------------
const char *StepperHAL::getLabel() const
{
    if (_timer == TIM2)
        return "motor1";
    if (_timer == TIM3)
        return "motor2";
    if (_timer == TIM4)
        return "motor3";
    if (_timer == TIM5)
        return "motor4";
    return "motor?";
}

void StepperHAL::setEnable(bool state)
{
    if (_enPin >= 0)
    {
        digitalWrite(_enPin, state ? 0 : 1); // LOW = enable attivo
        SerialDB.print("[StepperHAL] (");
        SerialDB.print(getLabel());
        SerialDB.print(") Driver ");
        SerialDB.println(state ? msg("abilitato", "enabled") : msg("disabilitato", "disabled"));
    }
    // I generate a step and reset the position otherwise an extra real step will be added to the first movement
    moveToPosition(step(1), Speed(100.0f));
    delay(100);
    _lastDir = 0;
    _position = 0;
    _logicalPosition = 0;
    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.println(msg("Passo di compensazione completato", "Compensation step completed"));
}

void StepperHAL::invertDIR(bool state)
{
    _invertDirection = state;
    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print(msg("Direzione invertita via software: ", "Direction inverted via software: "));
    SerialDB.println(state ? "ON" : "OFF");
}

void StepperHAL::setTiming(uint32_t stepPulseUs, uint32_t timerBaseFreq)
{
    _timing.stepPulseUs = stepPulseUs;
    _timing.timerBaseFreq = timerBaseFreq;
    _timing.compute(_timerClockHz);

    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print("[");
    SerialDB.print(timerName(_timer));
    SerialDB.print("] ");
    SerialDB.print(msg("Timing configurato → impulso = ", "Timing configured → pulse = "));
    SerialDB.print(stepPulseUs);
    SerialDB.print(" µs, ");
    SerialDB.print(msg("base timer = ", "base timer = "));
    SerialDB.print(timerBaseFreq);
    SerialDB.print(" Hz, ");
    SerialDB.print(msg("prescaler = ", "prescaler = "));
    SerialDB.print(_timing.prescaler);
    SerialDB.print(", ");
    SerialDB.print(msg("pulseTicks = ", "pulseTicks = "));
    SerialDB.print(_timing.pulseTicks);
    SerialDB.print(" | ");
    SerialDB.print(msg("System Clock = ", "System Clock = "));
    SerialDB.print(SystemCoreClock / 1000000);
    SerialDB.println(" MHz");
}

