nwlab/winding/firmware/Middlewares/Third_Party/StepperHAL_STM32F4x1-Library/src/StepperHAL_STM32F4x1.cpp
void StepperHAL::setMinFreqHz(float freqHz)
{
    if (freqHz < 1.0f)
        freqHz = 1.0f;
    _minFreqHz = freqHz;

    // RPM calculation for log
    float rpm = 0.0f;
    if (_stepsMotorRev > 0 && _microstep > 0)
    {
        rpm = _minFreqHz * 60.0f / (static_cast<float>(_stepsMotorRev) * static_cast<float>(_microstep));
    }

    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print("Min freq set — fMin=");
    SerialDB.print(_minFreqHz, 3);
    SerialDB.print(msg(" ; RPMmin=", " ; RPMmin="));
    SerialDB.print(rpm, 0);
    SerialDB.print(" ; ARR=");
    SerialDB.println(clampARRFromFreq(_timing.timerBaseFreq, _minFreqHz));
}

void StepperHAL::setMinRPM(float rpm)
{
    float f = (rpm * _stepsMotorRev * _microstep) / 60.0f;
    setMinFreqHz(f);
}

float StepperHAL::getMinFreqHz() const
{
    return _minFreqHz;
}

void StepperHAL::stop()
{
    _active = false;
    HAL_TIM_PWM_Stop(&_htim, _channel);
    HAL_TIM_Base_Stop_IT(&_htim);
}

void StepperHAL::resetPosition()
{
    _lastDir = 0;
    _position = 0;
    _logicalPosition = 0;
    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.println(msg(") Posizione logica e reale azzerata", ") Logic and real position reset"));
}

void StepperHAL::setPositionSteps(int32_t steps)
{
    int32_t offset = _position - _logicalPosition; // può essere positivo o negativo
    int32_t oldLogical = _logicalPosition;
    int32_t oldReal = _position;

    _logicalPosition = steps;
    _position = steps + offset;

    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print(msg("Posizione logica: ", "Logical pos: "));
    SerialDB.print(oldLogical);
    SerialDB.print(" -> ");
    SerialDB.print(_logicalPosition);
    SerialDB.print(msg(" ; reale: ", " ; real: "));
    SerialDB.print(oldReal);
    SerialDB.print(" -> ");
    SerialDB.println(_position);
}

void StepperHAL::setPositionMM(float mm)
{
    int32_t steps = static_cast<int32_t>(roundf(mm * stepsPerMM()));
    int32_t offset = _position - _logicalPosition; // preserve offset for logging
    int32_t oldLogical = _logicalPosition;
    int32_t oldReal = _position;

    _logicalPosition = steps;
    _position = steps + offset;

    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print(msg("Posizione logica (mm->steps): ", "Logical pos (mm->steps): "));
    SerialDB.print(mm, 6);
    SerialDB.print(" mm -> ");
    SerialDB.print(steps);
    SerialDB.print(msg(" passi ; precedente logica: ", " steps ; prev logical: "));
    SerialDB.print(oldLogical);
    SerialDB.print(" -> ");
    SerialDB.print(_logicalPosition);
    SerialDB.print(msg(" ; reale: ", " ; real: "));
    SerialDB.print(oldReal);
    SerialDB.print(" -> ");
    SerialDB.println(_position);
}

void StepperHAL::backlashCompensation(mm value)
{
    _backlashMM = value;
    _useBacklashMM = (value.value != 0.0f);
    _useBacklashStep = false;
}

void StepperHAL::backlashCompensation(step value)
{
    _backlashStep = value;
    _useBacklashStep = (value.count != 0);
    _useBacklashMM = false;
}

bool StepperHAL::targetReached() const
{
    return _position == _effectiveTarget;
}

bool StepperHAL::isActive() const
{
    return _active;
}

int32_t StepperHAL::getPositionSteps() const
{
    return _logicalPosition;
}

float StepperHAL::getPositionMM() const
{
    return static_cast<float>(getPositionSteps()) /
           (static_cast<float>(_stepsMotorRev) * static_cast<float>(_microstep)) * _mmPerRev;
}

uint32_t StepperHAL::getStepsPerRev() const
{
    return (uint32_t)(_stepsMotorRev * _microstep);
}

int32_t StepperHAL::getDiagAccelIndex() const
{
    return _diag_accelIndex;
}
int32_t StepperHAL::getDiagCruiseRemaining() const
{
    return _diag_cruiseRemaining;
}
int32_t StepperHAL::getDiagDecelIndex() const
{
    return _diag_decelIndex;
}
int StepperHAL::getDiagPhase() const
{
    return _diag_phase;
}

// -----------------------------
// ISR core
// -----------------------------
void StepperHAL::handleInterrupt()
{
    if (!_active)
        return;

    if (_useDMA)
    {
        switch (_currentPhase)
        {
        case PHASE_ACCEL:
            if (_accelIndex < _accelSize)
            {
                int32_t idx = _accelIndex;
                _accelIndex = idx + 1;
                _timer->ARR = _accelTable[idx];
            }
            else
            {
                _currentPhase = PHASE_CRUISE;
                _cruiseRemaining = _cruiseSize;
                _timer->ARR = _cruiseARR;
            }
            break;

        case PHASE_CRUISE:
        {
            int32_t remaining = _cruiseRemaining;
            if (remaining > 0)
            {
                _cruiseRemaining = remaining - 1;
                _timer->ARR = _cruiseARR;
            }
            else
            {
                _currentPhase = PHASE_DECEL;
                _decelIndex = 0;
            }
            break;
        }
        case PHASE_DECEL:
            if ((_decelIndex >= _decelSize) || (_position == _effectiveTarget))
            {
                _currentPhase = PHASE_DONE;
            }
            else
            {
                int32_t idx = _decelIndex;      // store current value
                _decelIndex = idx + 1;          // increment volatile safely
                _timer->ARR = _decelTable[idx]; // use stored value
            }
            break;
        case PHASE_IDLE:
            break;
        case PHASE_DONE:
            break;
        default:
            break;
        }

        if (_currentPhase != PHASE_DONE)
        {
            _position += (_direction ? -1 : 1);
        }

        if (_currentPhase == PHASE_DONE)
        {
            goto movement_completed;
        }

        _diag_accelIndex = _accelIndex;
        _diag_cruiseRemaining = _cruiseRemaining;
        _diag_decelIndex = _decelIndex;
        _diag_phase = (int)_currentPhase;
    }
    else
    {
        _position += (_direction ? -1 : 1);
        bool reached = (_position == _effectiveTarget) || _pendingStop;
        if (reached)
        {
            goto movement_completed;
        }
    }

    return;

movement_completed:
    __HAL_TIM_DISABLE_IT(&_htim, TIM_IT_UPDATE);
    HAL_TIM_PWM_Stop(&_htim, _channel);
    __HAL_TIM_DISABLE(&_htim);
    __HAL_TIM_SET_COMPARE(&_htim, _channel, 0);
    __HAL_TIM_SET_COUNTER(&_htim, 0);
    __HAL_TIM_CLEAR_FLAG(&_htim, TIM_FLAG_UPDATE);

    _logicalPosition = _pendingLogical;
    _active = false;
    _pendingStop = false;

    const char *dirLabel = (_moveDir > 0) ? "CW" : (_moveDir < 0 ? "CCW" : "STOP");

    SerialDB.print("[StepperHAL] (");
    SerialDB.print(getLabel());
    SerialDB.print(") ");
    SerialDB.print(
        msg("Movimento completato: fermo in posizione logica=", "Movement complete: stopped in position logical="));
    SerialDB.print(_logicalPosition);
    SerialDB.print(msg(": reale=", ": real="));
    SerialDB.print(_position);
    SerialDB.print(msg(" / target=", " / target="));
    SerialDB.print(_pendingLogical);
    SerialDB.print(msg(" / Dir=", " / Dir="));
    SerialDB.println(dirLabel);
}

TIM_HandleTypeDef &StepperHAL::getHandle()
{
    return _htim;
}
